<template>
  <div class="home">

    <h1>业务配置中心</h1>

    <p>请在左侧选择组件或者服务用于创建和查看</p>
    <p>目前没有删除操作,后续想通了逻辑后再考虑加不加删除</p>
    <p>服务的上线操作在服务的详情页,需要从服务列表中进入.</p>
    <p>一个未上线的服务可以修改,并点击更新上传到数据库;
      但修改后再上线并不是修改后的配置,需要先修改,再上传到数据库,刷新后看到详情已经更新了再点上线.</p>
    <p>一个已经上线的服务无法修改也无法主动下线</p>
    <p>一个未上线的服务上线会将与其同组件,同服务名的配置顶下线</p>
    <p>目前组件的配置模式和服务的配置可以在表单中填入json字符串或者导入文件加载</p>
    <p>要检查配置是否符合组件的模式规定,可以去对应的组件详情页通过上传json文件的形式加载判断</p>
  </div>
</template>

<script>

export default {
  name: 'Home'
}
</script>
